# Модуль для создания бургера

def add_loaf():
    """ Добавление булочки """
    print('А теперь добавим булочку.')


def add_rissole():
    """ Добавление котлеты """
    print('А теперь добавим котлету.')


def add_cucumber():
    """ Добавление огурца """
    print('А теперь добавим огурец.')


def add_tomato():
    """ Добавление помидора """
    print('А теперь добавим помидор.')


def add_mayo():
    """ Добавление майонеза """
    print('А теперь добавим майонез.')


def add_ketchup():
    """ Добавление кетчупа """
    print('А теперь добавим кетчуп.')


def add_cheese():
    """ Добавление сыра """
    print('А теперь добавим сыр.')


def add_onion():
    """ Добавление лука """
    print('А теперь добавим лук.')


def add_mustard():
    """ Добавление горчицы """
    print('А теперь добавим горчицу.')
